N = int(input())

mod = 9901
d = [[0, 0, 0] for _ in range(N + 1)]  # DP 저장 리스트
d[1] = [1, 1, 1]                       # 초기값

# 점화식 : D[N][L] = N칸에 넣는 경우의 수, L은 마지막 넣은 위치
# D[N][0] = D[N-1][0] + D[N-1][왼] + D[N-1][오]
# D[N][왼] = D[N-1][0] + D[N-1][오]
# D[N][오] = D[N-1][0] + D[N-1][왼]
# D[N][L] = D[N][0] + D[N-1][오] + D[N-1][왼]
for i in range(2, N + 1):
    d[i][0] = (d[i - 1][0] + d[i - 1][1] + d[i - 1][2]) % mod
    d[i][1] = (d[i - 1][0] + d[i - 1][2]) % mod
    d[i][2] = (d[i - 1][0] + d[i - 1][1]) % mod

print(sum(d[N]) % mod)